In [1]:
import pandas as pd
import numpy as np
import datetime

In [2]:
df = pd.read_csv("date_time.csv")

In [3]:
df.head()

          date_time
0  24-02-2015 22:24
1  01-11-2012 18:19
2  23-02-2019 15:54
3  28-01-2017 03:58
4  06-07-2018 07:44

In [4]:
df.shape

(200, 1)

In [5]:
df.dtypes

date_time    object
dtype: object

In [6]:
df["date_time"]= pd.to_datetime(df.date_time)

In [7]:
df.dtypes

date_time    datetime64[ns]
dtype: object

In [8]:
# Get hour
df["hour"] = df["date_time"].dt.hour

In [9]:
df.head()

            date_time  hour
0 2015-02-24 22:24:00    22
1 2012-01-11 18:19:00    18
2 2019-02-23 15:54:00    15
3 2017-01-28 03:58:00     3
4 2018-06-07 07:44:00     7

In [10]:
df["date"] = df["date_time"].dt.date

In [11]:
df.head()

            date_time  hour        date
0 2015-02-24 22:24:00    22  2015-02-24
1 2012-01-11 18:19:00    18  2012-01-11
2 2019-02-23 15:54:00    15  2019-02-23
3 2017-01-28 03:58:00     3  2017-01-28
4 2018-06-07 07:44:00     7  2018-06-07

In [12]:
df["time"] = df["date_time"].dt.time

In [13]:
df.head()

            date_time  hour        date      time
0 2015-02-24 22:24:00    22  2015-02-24  22:24:00
1 2012-01-11 18:19:00    18  2012-01-11  18:19:00
2 2019-02-23 15:54:00    15  2019-02-23  15:54:00
3 2017-01-28 03:58:00     3  2017-01-28  03:58:00
4 2018-06-07 07:44:00     7  2018-06-07  07:44:00

In [14]:
# get minute
df["minute"] = df["date_time"].dt.minute

In [15]:
df.head()

            date_time  hour        date      time  minute
0 2015-02-24 22:24:00    22  2015-02-24  22:24:00      24
1 2012-01-11 18:19:00    18  2012-01-11  18:19:00      19
2 2019-02-23 15:54:00    15  2019-02-23  15:54:00      54
3 2017-01-28 03:58:00     3  2017-01-28  03:58:00      58
4 2018-06-07 07:44:00     7  2018-06-07  07:44:00      44

In [16]:
df["second"] = df["date_time"].dt.second

In [17]:
df.head()

            date_time  hour        date      time  minute  second
0 2015-02-24 22:24:00    22  2015-02-24  22:24:00      24       0
1 2012-01-11 18:19:00    18  2012-01-11  18:19:00      19       0
2 2019-02-23 15:54:00    15  2019-02-23  15:54:00      54       0
3 2017-01-28 03:58:00     3  2017-01-28  03:58:00      58       0
4 2018-06-07 07:44:00     7  2018-06-07  07:44:00      44       0